[
  {
    "title": "Frontend Developer",
    "description": "Meet the hiring team\nDinka\nDinka Dedukic\n3rd+\nTalent Acquisition Manager at ANDRITZ Digital Factory\nJob poster\nMessage"
  },
  {
    "title": "Software Developer (M/F) - Split",
    "description": "About the job\nEricsson Nikola Tesla Group has nearly 3000 employees, the majority of whom are from the STEM field. In addition to our ICT solutions in the telecom sector, we provide innovative solutions in health care, transport, state administration, municipal services and multimedia that improve people’s lives and create new value. With more than 70 years of tradition and continuous work on new technologies, we offer the perfect combination of experience and knowledge. Our Research and Development Center is one of the strongest telecom R&D centers in the region.\n\nEricsson Nikola Tesla’s 5G and IoT Telecom Radio Network Units are looking for a\n\nSoftware Developer (M/F) - Split\n\nAs an engineer, this job gives you the opportunity to develop in professionally structured SW Architecture while following good coding practices!\n\nWe are looking for:\n\nJunior or Senior skills in C/C++/C#/Java/Python or similar programming languages\nGenuine interest in agile SW development and SW craftsmanship to write a clean code\nCommitment to continuous learning \nWillingness to experiment-try-fail-learn\nDesire to share achievements and knowledge to help others and address their needs\n\nYour environment will be:\n\nDevelopment\nSW Product development - C/C++ and/or Java\nSW Versioning through Git\nSW Development close to HW and on higher levels\nApplying automatized Code metrics: Static and Dynamic code analysis\nDeveloping Test Automation framework in C++ and/or Java\nUsing and developing applied Machine learning tools\n\nEnvironment\nEmbedded Linux programming\nDeveloping 5G network and IoT\n\nTeam\nClosely connected, self-organizing teams, Scrum or Kanban agile methodology\nWork in a cross-functional team that covers Systemization, Software Design, and Verification\nThe following experience would be considered a plus:\n\nProgramming and Automated testing in a structured environment\nSW build tools, SW versioning, Continuous Integration, and Continuous Development\nLinux, Embedded and Real-time systems\n\nEnablers:\n\nUniversity degree (Bachelor’s or Master’s) from a technical university\nProficiency in English language\n\nWe offer: \n\nIn addition to cutting-edge projects and technology, as well as the vibrant international ecosystem of experts, we can also point out:\n\nAn opportunity to work within an inspiring working environment where you can develop your career, grow, innovate and be a part of a larger success story \nAnnual awards in accordance with the company's business success and individual contribution \nIncentive bonuses \nCompany restaurant and monthly meal allowance \nSports and cultural sections \nRegular medical check-ups \nFlexible working hours \nCovered public transport costs \n& many more\n\nCroatian citizenship or a work permit for Croatia is required.\n\nCandidates will be evaluated and contacted if they pass the initial screening.\n\nIn our Privacy notice, you can find more about handling your personal information.\n\nEricsson provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, veteran status, union membership or genetics.\n\nEricsson complies with applicable country, state and all local laws governing nondiscrimination in employment in every location across the world in which the company has facilities. In addition, Ericsson supports the UN Guiding Principles for Business and Human Rights and the United Nations Global Compact.\n\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, training and development.\n\nEricsson expressly prohibits any form of workplace harassment based on race, color, religion, sex, sexual orientation, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, veteran status, union membership or genetic information.\n\n]]>"
  },
  {
    "title": "Front End Software Engineer",
    "description": "Meet the hiring team\nBarbora Emadi \n3rd+\nExperienced Talent Acquisition Specialist • Connecting talent to the right opportunity • Infobip\nMessage"
  },
  {
    "title": "Web Frontend Engineer - JS, CSS, React, Flutter",
    "description": "About the job\nThis is a general track for applications to any team at Canonical that works with web-centric tech (JS, TypeScript, React, CSS, Flutter), across all seniority levels.\n\nMany of Canonical's enterprise products have web front-ends. In order to create consistency across our products and sites, we have a central team that builds an open source React toolkit and presentation layer, the Vanilla Framework. We are excited to develop this further and see if we can help more open source projects build performant and accessible interfaces that respond well to diverse layouts. We use REST APIs for communication, and we consider API design an important part of the process.\n\nWe care about accessibility in our products and take time to work with designers.\n\nFlutter is a new front-end technology that has the potential to unify our desktop and web development. We are growing the team's exposure to Flutter and have roles on both web and Ubuntu engineering for this specialism.\n\nWe hire developers with outstanding academic results and a passion for open-source software, innovation, and cutting-edge web technologies. In these roles, you will have the opportunity to make significant contributions through high-quality, front-end and back-end code while exhibiting technical leadership, exceptional design, and intuitive user experience.\n\nAdditionally, we encourage colleagues to engage with the broader open-source community. We're looking for individuals who can help build a thriving community, contribute to a broad range of technologies, and ensure seamless software operations at scale.\n\nLocation: Our web and Flutter engineering is largely in European, Middle Eastern, African and American time zones.\n\nWhat your day will look like\n\nWrite high-quality, well-designed software\nCollaborate proactively with a globally distributed team\nDisplay technical leadership internally and within our external communities\nDebug issues and produce high-quality code to fix them\nContribute to technical documentation to make it the best of its kind\nDiscuss ideas and collaborate on finding good solutions\nWork from home with global travel twice annually for company events\n\nWhat we are looking for in you\n\nAn exceptional academic track record from both high school and university\nUndergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path\nDrive and a track record of going above-and-beyond expectations\nWell-organised, self-starting and able to deliver to schedule\nProfessional manner interacting with colleagues, partners, and community\nKnowledge of web (HTML, CSS and JS) tech\nFluency in Typescript, React or Flutter\nAn eye for accessibility and performance\nProfessional written and spoken English \nExperience with Linux (Debian or Ubuntu preferred) \nExcellent interpersonal skills, curiosity, flexibility, and accountability \nPassion, thoughtfulness, and self-motivation \nExcellent communication and presentation skills \nResult-oriented, with a personal drive to meet commitments \nAbility to travel twice a year, for company events up to two weeks each\n\nAdditional Skills That You Might Also Bring\n\nExperience with container tech such as LXD, Docker and Kubernetes\nCuriosity about all aspects of web development\nAttention to detail in regard to user-centric UI development\nExperience with systems programming or scalable web services\nREST API design, development and governance\nPerformance engineering and security experience\n\nWhat we offer you\n\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\n\nDistributed work environment with twice-yearly team sprints in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nEmployee Assistance Programme\nOpportunity to travel to new locations to meet colleagues\nPriority Pass, and travel upgrades for long-haul company events\n\nAbout Canonical\n\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.\n\nCanonical is an equal opportunity employer\n\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration."
  }
]