[
  {
    "title": "Frontend Developer",
    "description": "Meet the hiring team\nDinka\nDinka Dedukic\n3rd+\nTalent Acquisition Manager at ANDRITZ Digital Factory\nJob poster\nMessage"
  },
  {
    "title": "Junior Software Engineer (Student)",
    "description": "About the job\nYour profile\n\nWe are in search of a talented and passionate Junior Software Engineer to join our innovative team. If you are driven by the opportunity to solve complex problems, thrive in a fast-paced environment, and have a keen eye for detail, then this role is tailored for you.\n\nWhat You'll Do\n\nFocus on developing software solutions for clients \nUse best practices at every stage of the development cycle \nTroubleshoot and debug applications \n\nWhat We’re Looking For\n\nCurrent studies in Computer Science, Engineering, or a related field\nExperience/knowledge with C# and JavaScript (you’ll quickly adjust with previous knowledge of any of the following: Knockout, React, Angular)\nExperience with SQL; Plus is knowledge about OData, LinQ, EntityFramework\nExperience with using Git\nUnderstanding of RESTful Web Services\nUnderstanding of Agile methodologies such as Scrum\nFluency in English (written and spoken)\n\nWhat We Offer\n\nWork in a fast-growing and engaging industry\nDynamic workplaces (biking or standing behind your desk, currently also working from home)\nCompetitive salary and additional benefits (Birthday gift, Meal allowance, additional bonuses)\nA good cup of coffee or tea with a snack or fresh fruit available all day long\nTop-notch offices and equipment\nContinuous improvement and learning opportunities\nTeam activities, not the usual ones just to look nice on social media but what team members choose and ask for\n\nIf you're seeking a workplace where growth, flexibility, and a sense of community come together, we invite you to explore this exciting opportunity with us.\n\nAbout Us\n\nThe first thing you may be asking yourself is, what is Cenosco all about?\n\nWe're an Asset Integrity Management (AIM) Software company. Essentially, this means that our solutions safeguard integrity, reliability, and instrumentation safety in asset-heavy industries. Companies operating in these industries come with complex operational ecosystems, and we aim to support their capability to operate at full potential, with the latest technologies, all while prioritizing the health and safety of their people and the environment.\n\nVision\n\nWe envision safe and smart environments for asset-heavy industries - where their software environment, work environment, and surrounding environment, operate smartly and securely, allowing them to function at their full potential, without jeopardizing the health and safety of their people and the planet.\n\nMission\n\nWe are dedicated to making this vision a reality, by optimizing and spreading our integrity management solutions. Through continuous innovation and development of our IMS Suite, we strive to remain the market standard for integrity management solutions.\n\nThe Cenosco Culture\n\nOur work culture is bound by our four core values. These values have been carefully crafted and selected internally to ensure that they served as a reflection of who we are and how we work across the entire company. At Cenosco we operate with these values at heart, and therefore consider them to be vital competencies.\n\nActing With Integrity\n\nWe are trustworthy and reliable.\n\nBehaving Innovatively\n\nWe are agile, curious, and keep growing.\n\nOwning And Delivering\n\nWe take ownership, responsibility and strive for success.\n\nPlaying As a Team\n\nWe are attentive, inspire, have fun and celebrate our successes."
  },
  {
    "title": "Software Developer (M/F) - Split",
    "description": "About the job\nEricsson Nikola Tesla Group has nearly 3000 employees, the majority of whom are from the STEM field. In addition to our ICT solutions in the telecom sector, we provide innovative solutions in health care, transport, state administration, municipal services and multimedia that improve people’s lives and create new value. With more than 70 years of tradition and continuous work on new technologies, we offer the perfect combination of experience and knowledge. Our Research and Development Center is one of the strongest telecom R&D centers in the region.\n\nEricsson Nikola Tesla’s 5G and IoT Telecom Radio Network Units are looking for a\n\nSoftware Developer (M/F) - Split\n\nAs an engineer, this job gives you the opportunity to develop in professionally structured SW Architecture while following good coding practices!\n\nWe are looking for:\n\nJunior or Senior skills in C/C++/C#/Java/Python or similar programming languages\nGenuine interest in agile SW development and SW craftsmanship to write a clean code\nCommitment to continuous learning \nWillingness to experiment-try-fail-learn\nDesire to share achievements and knowledge to help others and address their needs\n\nYour environment will be:\n\nDevelopment\nSW Product development - C/C++ and/or Java\nSW Versioning through Git\nSW Development close to HW and on higher levels\nApplying automatized Code metrics: Static and Dynamic code analysis\nDeveloping Test Automation framework in C++ and/or Java\nUsing and developing applied Machine learning tools\n\nEnvironment\nEmbedded Linux programming\nDeveloping 5G network and IoT\n\nTeam\nClosely connected, self-organizing teams, Scrum or Kanban agile methodology\nWork in a cross-functional team that covers Systemization, Software Design, and Verification\nThe following experience would be considered a plus:\n\nProgramming and Automated testing in a structured environment\nSW build tools, SW versioning, Continuous Integration, and Continuous Development\nLinux, Embedded and Real-time systems\n\nEnablers:\n\nUniversity degree (Bachelor’s or Master’s) from a technical university\nProficiency in English language\n\nWe offer: \n\nIn addition to cutting-edge projects and technology, as well as the vibrant international ecosystem of experts, we can also point out:\n\nAn opportunity to work within an inspiring working environment where you can develop your career, grow, innovate and be a part of a larger success story \nAnnual awards in accordance with the company's business success and individual contribution \nIncentive bonuses \nCompany restaurant and monthly meal allowance \nSports and cultural sections \nRegular medical check-ups \nFlexible working hours \nCovered public transport costs \n& many more\n\nCroatian citizenship or a work permit for Croatia is required.\n\nCandidates will be evaluated and contacted if they pass the initial screening.\n\nIn our Privacy notice, you can find more about handling your personal information.\n\nEricsson provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, veteran status, union membership or genetics.\n\nEricsson complies with applicable country, state and all local laws governing nondiscrimination in employment in every location across the world in which the company has facilities. In addition, Ericsson supports the UN Guiding Principles for Business and Human Rights and the United Nations Global Compact.\n\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, training and development.\n\nEricsson expressly prohibits any form of workplace harassment based on race, color, religion, sex, sexual orientation, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, veteran status, union membership or genetic information.\n\n]]>"
  },
  {
    "title": "5G Embedded Software Developer (M/F) - Zagreb, Split, Osijek",
    "description": "About the job\nEricsson Nikola Tesla Group has nearly 3000 employees, the majority of whom are from the STEM field. In addition to our ICT solutions in the telecom sector, we provide innovative solutions in health care, transport, state administration, municipal services and multimedia that improve people’s lives and create new value. With more than 70 years of tradition and continuous work on new technologies, we offer the perfect combination of experience and knowledge.\n\nWhat do we develop?\n\nWe perform software development, hardware integration, and system verification of the Radio Unit, a crucial node of the Ericsson Radio System portfolio.\n\nOur projects are vital contributors to the latest 5G solutions, as well as to enhancements of already deployed 4G products.\n\nYou can find our products being used all over the world, deployed by operators such as AT&T, T-Mobile, Softbank … There are literally millions of sites that rely on our expertise and bring wireless connectivity to billions of people.\n\nOur work environment\n\nWe are close to 20 teams in Zagreb and we cooperate daily with our colleagues around the world (Sweden, China, Canada …).\n\nOur teams are involved in all phases of the development cycle, including initial requirement analysis, study, design, implementation, verification, delivery, and maintenance. The teams are closely connected, and self-organizing, based on their own customization of Scrum or Kanban methodology.\n\nYour laptop might be Windows-based, but both the development and target environment are pure Linux.\n\nWhich competence areas do we need?\n\nThere is a wide range of technical expertise our teams require in their daily work:\n\nEmbedded systems with real-time capabilities (both hardware and software aspects)\nOperating system principles (Linux in particular)\nSignal processing\nAntenna systems\nComputer and mobile networks\nC/C++ programming language for product development\nSecure coding practices\nJava/Python/Perl/Bash for automation and verification\nCode repositories and versioning systems (such as Git and Gerrit)\nSoftware product build systems (such as Yocto and Automake)\nEricsson product-specific knowledge\nIntegration, troubleshooting, and debugging skills\n\nExpected levels of the above items are based on your seniority and the requirements of a specific project.\n\nWhat do we offer?\n\nIn addition to cutting-edge projects and technology, as well as the opportunity to work in a vibrant international team of experts, we can also point out the following:\n\nan opportunity to work in an inspiring working environment where you can develop your career, grow, innovate, and be a part of larger success story\nannual awards in accordance with the company’s business results and individual contribution\nincentive bonuses\ncompany restaurant and monthly meal allowance\nsports and cultural sections\nregular medical check-ups\nsupplementary health insurance\nflexible working hours\ncovered public transport costs\nand many more.\n\nOur expectations from you\n\nWe would like you to:\n\nFind our area of work intriguing\nHave expertise and interest in (several) mentioned technical areas\nBe ready for steep and continuous competence build-up\nSuccessfully collaborate with your colleagues\nFeel comfortable in an international work environment\n\nAssuming you found the description above interesting, please apply and include your CV. Any personal projects (on GitHub or similar) are also welcome.\n\nA closing note: final-year students of technical universities are also welcome to apply.\n\nCroatian citizenship or a work permit for Croatia is mandatory.\n\nCandidates will be evaluated and contacted only if they pass the initial screening.\n\nIn our Privacy notice you can find more about the way your personal information is handled.\n\n]]>"
  },
  {
    "title": "Software Engineer",
    "description": "Meet the hiring team\nBarbora Emadi \n3rd+\nExperienced Talent Acquisition Specialist • Connecting talent to the right opportunity • Infobip\nMessage"
  },
  {
    "title": "Java Software Engineer",
    "description": "About the job\nWe believe that we are better together, and at Tripadvisor we welcome you for who you are. Our workplace is for everyone, as is our people powered platform. At Tripadvisor, we want you to bring your unique perspective and experiences, so we can collectively revolutionize travel and together find the good out there.\n\nThe Places team mission is to build the world's best engine for managing location data. We are enhancing data collection on the main site and our mobile apps, building a data processing pipeline, integrating with third-party vendors, and leveraging machine learning, all to curate location data valuable to TripAdvisor users and our partners.\n\nAs a Java Software Engineer, you will independently develop features in support of our products across all layers of the stack. You will be responsible for designing relational databases, microservices, APIs, and interactive user interfaces. Through your work you will grow expertise in one or more technologies and share your learnings with your team. You will be responsible for testing the software you write and will maintain your features once released. As a Software Engineer II, you will actively provide code reviews to your peers, ensuring that team standards and best practices are adhered to. Similarly, you will actively seek feedback from your peers and promote a collaborative and fast-paced engineering culture.\n\nWhat You'll Do\n\nCode! Most of our engineer’s release code to production every few days and we have a daily release cycle.\nDesign and implement the technical solutions for projects\nWork closely with our product and design teams to define feature specifications\nBe responsible for the quality of code you ship\nActively provide feedback on best practices and design patterns to your peers in the form of code reviews\nDevelop, deploy and maintain full stack implementations of owner and consumer-facing features\nBe responsible for all aspects of software engineering, from design to implementation, QA, operations and maintenance.\nWork alongside other engineering groups located around the world - US East Coast, UK, Central and Eastern Europe. \n\nSkills And Experience\n\nBachelor of Science in Computer Science or equivalent\n4+ years of large scale, full life cycle development experience\nSolid foundation in data structures, algorithms, and OO design\nExperience building microservices, event-driven and domain-oriented architectures\nExperience with full stack web development in JavaScript and Java. The team develops with JavaScript/React, Java, Tomcat, Linux, PostgreSQL, Snowflake, Docker, Kubernetes, Kafka \nCloud Platform experience (AWS) desired\n Experience with data processing or ML modeling is a plus.\n\nIf you need a reasonable accommodation or support during the application or the recruiting process due to a medical condition or disability, please reach out to your individual recruiter or send an email to AccessibleRecruiting@Tripadvisor.com and let us know the nature of your request . Please include the job requisition number in your message."
  },
  {
    "title": "Web Frontend Engineer - JS, CSS, React, Flutter",
    "description": "About the job\nThis is a general track for applications to any team at Canonical that works with web-centric tech (JS, TypeScript, React, CSS, Flutter), across all seniority levels.\n\nMany of Canonical's enterprise products have web front-ends. In order to create consistency across our products and sites, we have a central team that builds an open source React toolkit and presentation layer, the Vanilla Framework. We are excited to develop this further and see if we can help more open source projects build performant and accessible interfaces that respond well to diverse layouts. We use REST APIs for communication, and we consider API design an important part of the process.\n\nWe care about accessibility in our products and take time to work with designers.\n\nFlutter is a new front-end technology that has the potential to unify our desktop and web development. We are growing the team's exposure to Flutter and have roles on both web and Ubuntu engineering for this specialism.\n\nWe hire developers with outstanding academic results and a passion for open-source software, innovation, and cutting-edge web technologies. In these roles, you will have the opportunity to make significant contributions through high-quality, front-end and back-end code while exhibiting technical leadership, exceptional design, and intuitive user experience.\n\nAdditionally, we encourage colleagues to engage with the broader open-source community. We're looking for individuals who can help build a thriving community, contribute to a broad range of technologies, and ensure seamless software operations at scale.\n\nLocation: Our web and Flutter engineering is largely in European, Middle Eastern, African and American time zones.\n\nWhat your day will look like\n\nWrite high-quality, well-designed software\nCollaborate proactively with a globally distributed team\nDisplay technical leadership internally and within our external communities\nDebug issues and produce high-quality code to fix them\nContribute to technical documentation to make it the best of its kind\nDiscuss ideas and collaborate on finding good solutions\nWork from home with global travel twice annually for company events\n\nWhat we are looking for in you\n\nAn exceptional academic track record from both high school and university\nUndergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path\nDrive and a track record of going above-and-beyond expectations\nWell-organised, self-starting and able to deliver to schedule\nProfessional manner interacting with colleagues, partners, and community\nKnowledge of web (HTML, CSS and JS) tech\nFluency in Typescript, React or Flutter\nAn eye for accessibility and performance\nProfessional written and spoken English \nExperience with Linux (Debian or Ubuntu preferred) \nExcellent interpersonal skills, curiosity, flexibility, and accountability \nPassion, thoughtfulness, and self-motivation \nExcellent communication and presentation skills \nResult-oriented, with a personal drive to meet commitments \nAbility to travel twice a year, for company events up to two weeks each\n\nAdditional Skills That You Might Also Bring\n\nExperience with container tech such as LXD, Docker and Kubernetes\nCuriosity about all aspects of web development\nAttention to detail in regard to user-centric UI development\nExperience with systems programming or scalable web services\nREST API design, development and governance\nPerformance engineering and security experience\n\nWhat we offer you\n\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\n\nDistributed work environment with twice-yearly team sprints in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nEmployee Assistance Programme\nOpportunity to travel to new locations to meet colleagues\nPriority Pass, and travel upgrades for long-haul company events\n\nAbout Canonical\n\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.\n\nCanonical is an equal opportunity employer\n\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration."
  },
  {
    "title": "Node.JS Developer",
    "description": "About the job\nWe are currently seeking a talented and experienced Node.js Developer\n\nResponsibilities\n\nDevelop and maintain server-side web applications using Node.js \nCollaborate with cross-functional teams to design and implement robust APIs and backend systems \nWrite clean and efficient code, following best practices and coding standards \nConduct thorough testing and debugging of applications to ensure high-quality deliverables \nOptimize application performance and scalability \nStay up-to-date with the latest trends and advancements in Node.js development\n\nRequirements\n\nProven experience as a Node.js Developer, with a solid understanding of Node.js and its core principles \nProficiency in JavaScript \nKnowledge of Express.js or similar web application frameworks \nExperience with NoSQL databases, such as MongoDB \nUnderstanding of asynchronous programming and event-driven architectures \nExperience with version control systems, preferably Git \nStrong problem-solving skills and the ability to work in a collaborative team environment \nExcellent communication and interpersonal skills \n\nNice to have: Familiarity with front-end technologies such as HTML, CSS, and JavaScript frameworks (e.g., React, Angular, Vue.js)\n\nWe Offer\n\nFlexible work-hours \npart-time/full-time \nCompetitive salary"
  }
]